# TypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDataInstanceRemovedFromDocumentEventArgs..::..TypeId Property
ExternalDataInstanceRemovedFromDocumentEventArgs Class See Also
---
The type id of the external data instance id that has been removed from Revit document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId TypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
```

# See Also
ExternalDataInstanceRemovedFromDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace